src/cf/InformationRegisters/КоличествоБлокируемыхОбъектовКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КоличествоБлокируемыхОбъектовКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыБлокирующиеЗагрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыБлокирующиеЗагрузку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеТипа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФорматаКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КоличествоБлокируемыхОбъектовКЗагрузке/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область БазовыеМетодыЗаписи

// Конструктор новой записи регистра
// 
// Возвращаемое значение:
//  Структура - Новый данные записи регистра:
// * ОбъектКПолучению                          - Строка - идентификатор объекта, который блокирует загрузку других объектов.
// * ОбъектФормата                             - Строка - идентификатор объекта формата блокирующего объекта.
// * УзелПланаОбмена                           - ПланОбменаСсылкаИмяПланаОбмена, Неопределено - узел плана обмена, для
//     которого поступило сообщение.
// * Количество                                - Число - количество блокируемых объектов
// * МинимальнаяДатаУстановкиПричиныДобавления - Дата - дата самого раннего заблокированного объекта
//
Функция НовыйДанныеЗаписиРегистра() Экспорт
	
	ДанныеЗаписиРегистра = Новый Структура;
	
	ДанныеЗаписиРегистра.Вставить("ОбъектКПолучению",                          "");
	ДанныеЗаписиРегистра.Вставить("ОбъектФормата",                             "");
	ДанныеЗаписиРегистра.Вставить("УзелПланаОбмена",                           Неопределено);
	ДанныеЗаписиРегистра.Вставить("Количество",                                0);
	ДанныеЗаписиРегистра.Вставить("МинимальнаяДатаУстановкиПричиныДобавления", Дата(1, 1, 1));
	
	Возврат ДанныеЗаписиРегистра;
	
КонецФункции

// Выполняет запись в регистр
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
//
Процедура ЗаписатьДанные(ДанныеЗаписи) Экспорт
	
	ДанныеРегистра = НаборИЗаписьРегистра(ДанныеЗаписи);
	
	ЗаполнитьЗначенияСвойств(ДанныеРегистра.ЗаписьНабора, ДанныеЗаписи);
	
	ДанныеРегистра.НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет запись из регистра
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
//
Процедура УдалитьЗаписьРегистра(ДанныеЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектКПолучению.Установить(ДанныеЗаписи.ОбъектКПолучению);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область РасчетЗаписейРегистра

// Рассчитывает данные записей регистра для переданных объектов к получению в виде таблицы.
// 
// Параметры:
//  ТаблицаОбъектыКПолучению - ТаблицаЗначений - содержит объекты к получению:
//   * ОбъектКПолучению - Строка 
// 
Процедура РассчитатьДанныеПоТаблицеОбъектов(ТаблицаОбъектыКПолучению) Экспорт
	
	Если ТаблицаОбъектыКПолучению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКПолучению.ОбъектКПолучению        КАК ОбъектКПолучению,
	|	ОбъектыКПолучению.ОбъектФорматаКПолучению КАК ОбъектФорматаКПолучению,
	|	ОбъектыКПолучению.УзелПланаОбмена         КАК УзелПланаОбмена
	|ПОМЕСТИТЬ ОбъектыКПолучению
	|ИЗ
	|	&ОбъектыКПолучению КАК ОбъектыКПолучению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыКПолучению.ОбъектКПолучению                       КАК ОбъектКПолучению,
	|	ОбъектыКПолучению.ОбъектФорматаКПолучению                КАК ОбъектФорматаКПолучению,
	|	ОбъектыКПолучению.УзелПланаОбмена                        КАК УзелПланаОбмена,
	|	СУММА(ВЫБОР
	|			КОГДА ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ)                                               КАК Количество,
	|	МИНИМУМ(ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления) КАК МинимальнаяДатаУстановкиПричиныДобавления
	|ИЗ
	|	ОбъектыКПолучению КАК ОбъектыКПолучению
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ПО ОбъектыКПолучению.ОбъектКПолучению = ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению
	|		И ОбъектыКПолучению.УзелПланаОбмена = ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена
	|		И ОбъектыКПолучению.ОбъектФорматаКПолучению = ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект = ОбъектыКЗагрузке.ПолученныйОбъект
	|			И ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации = ОбъектыКЗагрузке.ПравилоКонвертации
	|			И ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ОбъектыБлокирующиеЗагрузку.ОбъектФормата = ОбъектыКЗагрузке.ОбъектФормата
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыКПолучению.ОбъектКПолучению,
	|	ОбъектыКПолучению.ОбъектФорматаКПолучению,
	|	ОбъектыКПолучению.УзелПланаОбмена";
	 
	Запрос.УстановитьПараметр("ОбъектыКПолучению", ТаблицаОбъектыКПолучению);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
		ДанныеЗаписи.ОбъектКПолучению                          = Выборка.ОбъектКПолучению;
		ДанныеЗаписи.ОбъектФормата                             = Выборка.ОбъектФорматаКПолучению;
		ДанныеЗаписи.МинимальнаяДатаУстановкиПричиныДобавления = Выборка.МинимальнаяДатаУстановкиПричиныДобавления;
		ДанныеЗаписи.УзелПланаОбмена                           = Выборка.УзелПланаОбмена;
		
		Если Выборка.Количество = 0 Тогда
			
			УдалитьЗаписьРегистра(ДанныеЗаписи);
			
		Иначе
			
			ДанныеЗаписи.Количество = Выборка.Количество;
			ЗаписатьДанные(ДанныеЗаписи);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет перерасчет всех записей регистра
Процедура ПересчитатьВсеЗаписиРегистра() Экспорт
	
	ОчиститьЗаписиРегистра();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению              КАК ОбъектКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению       КАК ОбъектФорматаКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена               КАК УзелПланаОбмена,
	|	КОЛИЧЕСТВО(ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению)  КАК Количество,
	|	МИНИМУМ(ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления) КАК МинимальнаяДатаУстановкиПричиныДобавления
	|ИЗ
	|	РегистрСведений.ОбъектыБлокирующиеЗагрузку КАК ОбъектыБлокирующиеЗагрузку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ОбъектыБлокирующиеЗагрузку.ПолученныйОбъект = ОбъектыКЗагрузке.ПолученныйОбъект
	|			И ОбъектыБлокирующиеЗагрузку.ПравилоКонвертации = ОбъектыКЗагрузке.ПравилоКонвертации
	|			И ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена    = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ОбъектыБлокирующиеЗагрузку.ОбъектФормата      = ОбъектыКЗагрузке.ОбъектФормата
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыБлокирующиеЗагрузку.ОбъектКПолучению,
	|	ОбъектыБлокирующиеЗагрузку.УзелПланаОбмена,
	|	ОбъектыБлокирующиеЗагрузку.ОбъектФорматаКПолучению";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
		ДанныеЗаписи.ОбъектКПолучению                          = Выборка.ОбъектКПолучению;
		ДанныеЗаписи.УзелПланаОбмена                           = Выборка.УзелПланаОбмена;
		ДанныеЗаписи.ОбъектФормата                             = Выборка.ОбъектФорматаКПолучению;
		ДанныеЗаписи.Количество                                = Выборка.Количество;
		ДанныеЗаписи.МинимальнаяДатаУстановкиПричиныДобавления = Выборка.МинимальнаяДатаУстановкиПричиныДобавления;
		
		ЗаписатьДанные(ДанныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция НаборИЗаписьРегистра(ДанныеЗаписи)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектКПолучению.Установить(ДанныеЗаписи.ОбъектКПолучению);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		
	Иначе
		
		ЗаписьНабора = НаборЗаписей[0];
		
	КонецЕсли; 
	
	ДанныеРегистра = Новый Структура;
	ДанныеРегистра.Вставить("НаборЗаписей", НаборЗаписей);
	ДанныеРегистра.Вставить("ЗаписьНабора", ЗаписьНабора);
	
	Возврат ДанныеРегистра;
	
КонецФункции

Процедура ОчиститьЗаписиРегистра()
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
